IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
/**-------------------------------------------------------------------------
@file	bt_sec_sd.cpp

@brief	IOsonata security manager for the nRF5 SDK SoftDevice path.

		Replaces the nRF5 SDK peer_manager modules security_manager.c and
		security_dispatcher.c with one module. It implements the sm_* API
		surface that peer_manager.c calls (security_manager.h), emits the same
		pm_evt_t events through pm_sm_evt_handler, and drives the SoftDevice
		GAP security procedures directly. The peer data layer stays SDK:
		peer_database, peer_data_storage, id_manager, pm_buffer and FDS are
		used unchanged, which keeps bond records byte-identical for the SDK
		OTA DFU bootloader handoff (ble_dfu_bonded).

		LESC runs on the IOsonata bt_lesc module (bt_lesc_sd.cpp) through the
		BtLesc* names; nrf_ble_lesc and its shim are not used. This module is
		the single delivery point of BLE events into BtLescOnBleEvt.

		The keyset handed to sd_ble_gap_sec_params_reply points into the
		pm_peer_data_bonding_t inside the peer_database write buffer, so the
		SoftDevice writes the distributed keys straight into the FDS-destined
		structure; AUTH_STATUS commits it with pdb_write_buf_store. This is
		what guarantees the FDS record layout identity.

		Repeated pairing attempt protection: the SDK auth_status_tracker
		module (ast_*) stays linked; failures are reported to it and
		blacklisted peers are rejected with BLE_GAP_SEC_STATUS_REPEATED_ATTEMPTS,
		gated by PM_RA_PROTECTION_ENABLED as in the SDK.

		Both roles are implemented. Runs entirely in the pm BLE event dispatch
		context, the same as the SDK modules it replaces.

@author	Hoang Nguyen Hoan
@date	Jul. 11, 2026

@license

MIT License

Copyright (c) 2026, I-SYST, all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
----------------------------------------------------------------------------*/
#include <string.h>

#include "sdk_common.h"

#if NRF_MODULE_ENABLED(PEER_MANAGER)

#include "ble.h"
#include "ble_gap.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_conn_state.h"
#include "nrf_sdh_ble.h"			// NRF_SDH_BLE_TOTAL_LINK_COUNT

#include "security_manager.h"		// the sm_* API this module implements
#include "security_dispatcher.h"	// smd_init, called by pm_init; the rest of
									// the smd layer is absorbed into this module
#include "peer_manager_types.h"
#include "peer_manager_internal.h"	// pm_sm_evt_handler
#include "peer_database.h"
#include "peer_data_storage.h"
#include "id_manager.h"

#if PM_RA_PROTECTION_ENABLED
#include "auth_status_tracker.h"
#endif

#include "bt_lesc.h"

// Event sink in peer_manager.c; the same extern hookup the SDK sm uses.
extern "C" void pm_sm_evt_handler(pm_evt_t * p_sm_evt);

// The context type used in PM_EVT_CONN_SEC_PARAMS_REQ events and in calls to
// sm_sec_params_reply(). Layout compatible with the SDK sm context: the app
// interacts with it only through sm_sec_params_reply.
typedef struct {
	ble_gap_sec_params_t *pSecParams;		// params to use in the reply
	ble_gap_sec_params_t  SecParamsMem;		// buffer holding the params
	bool                  bReplyCalled;		// sm_sec_params_reply was called
} SecParamsReplyCtx_t;

static bool                          s_bInit;
static ble_gap_sec_params_t          s_SecParams;			// default sec params buffer
static ble_gap_sec_params_t         *s_pSecParams;			// NULL until sm_sec_params_set

// SIG policy the frozen SDK never offered. SC only rejects legacy pairing
// with Authentication Requirements (Core Vol 3 Part H 2.3.5.1); the minimum
// encryption key size is checked on every CONN_SEC_UPDATE and an under-keyed
// link is failed and disconnected (KNOB class downgrade mitigation). The SMP
// floor is 7; security sensitive applications set 16.
static bool                          s_bScOnly;
static uint8_t                       s_MinKeySize = 7;

// Per-connection state, indexed by connection handle (SoftDevice handles are
// 0 .. NRF_SDH_BLE_TOTAL_LINK_COUNT-1). PeerPk is the LESC peer public key
// receive buffer for the keyset: per link, so concurrent pairings cannot
// overwrite each other (the SDK dispatcher shares one static buffer here).
// The pending reply record preserves the exact application answer, including
// a rejection, across an NRF_ERROR_BUSY retry; the SDK loses it and re-asks.
typedef struct {
	ble_gap_lesc_p256_pk_t PeerPk;			// SoftDevice writes the peer key here
	ble_gap_sec_params_t   ReplyParams;		// pending reply parameters
	bool                   bReplyValid;		// a reply is pending retry
	bool                   bReplyReject;	// the pending reply is a rejection
	bool                   bStorePending;	// bond store deferred on busy
	bool                   bStoreNewPeer;	// the pending store allocated the peer id
	bool                   bDisconnPending;	// disconnect deferred on busy
	pm_peer_id_t           StorePeerId;		// peer id of the pending store
	uint8_t                EncrKeySize;		// negotiated key size, from CONN_SEC_UPDATE
} BtSecSdLink_t;

static BtSecSdLink_t s_Links[NRF_SDH_BLE_TOTAL_LINK_COUNT];

static inline BtSecSdLink_t *LinkGet(uint16_t ConnHdl)
{
	return (ConnHdl < NRF_SDH_BLE_TOTAL_LINK_COUNT) ? &s_Links[ConnHdl] : nullptr;
}

