IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
static void LinkReplyClear(uint16_t ConnHdl)
{
	BtSecSdLink_t *pLink = LinkGet(ConnHdl);
	if (pLink != nullptr)
	{
		pLink->bReplyValid  = false;
		pLink->bReplyReject = false;
	}
}

// Procedure bookkeeping and retry flags, one bit per connection.
static ble_conn_state_user_flag_id_t s_FlagSecProc          = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagSecProcPairing   = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagSecProcBonding   = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagAllowRepairing   = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagSecurePendBusy   = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagSecureForceRepair = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagSecureNullParams = BLE_CONN_STATE_USER_FLAG_INVALID;
static ble_conn_state_user_flag_id_t s_FlagReplyPendBusy    = BLE_CONN_STATE_USER_FLAG_INVALID;

// ---- Event emission ---------------------------------------------------------

static pm_evt_t NewEvt(pm_evt_id_t EvtId, uint16_t ConnHdl)
{
	pm_evt_t evt;

	memset(&evt, 0, sizeof(evt));
	evt.evt_id      = EvtId;
	evt.conn_handle = ConnHdl;
	evt.peer_id     = im_peer_id_get_by_conn_handle(ConnHdl);

	return evt;
}

static void EvtSend(pm_evt_t *pEvt)
{
	pm_sm_evt_handler(pEvt);
}

static void UnexpectedErrorSend(uint16_t ConnHdl, ret_code_t ErrCode)
{
	pm_evt_t evt = NewEvt(PM_EVT_ERROR_UNEXPECTED, ConnHdl);

	evt.params.error_unexpected.error = ErrCode;
	EvtSend(&evt);
}

// The bond store found no room in flash. The write buffer is kept by
// peer_database and reattempted after the next garbage collection, so this is
// reported as a distinct, recoverable event rather than an unexpected error.
static void StorageFullSend(uint16_t ConnHdl)
{
	pm_evt_t evt = NewEvt(PM_EVT_STORAGE_FULL, ConnHdl);

	EvtSend(&evt);
}

// Drop a link whose security this device has refused.
//
// sd_ble_gap_disconnect accepts two HCI reasons, documented on the call in
// ble_gap.h: BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION and
// BLE_HCI_CONN_INTERVAL_UNACCEPTABLE. Anything else, Authentication Failure
// included, is answered with NRF_ERROR_INVALID_PARAM and the link stays up.
// Core Vol 4 Part E 7.1.6 lists Remote User Terminated Connection among the
// reasons a Host may give in HCI_Disconnect, so the accepted value is a valid
// one to put on air as well.
//
// NRF_ERROR_BUSY means another procedure holds the link for the moment, not
// that the link may stay; the request is kept and repeated by the pumps. A
// link that is already gone, or already dropping, needs nothing further.
static void SecDisconnect(uint16_t ConnHdl)
{
	ret_code_t r = sd_ble_gap_disconnect(ConnHdl,
										 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	BtSecSdLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr)
	{
		pLink->bDisconnPending = (r == NRF_ERROR_BUSY);
	}

	if (r == NRF_SUCCESS || r == NRF_ERROR_BUSY || r == NRF_ERROR_INVALID_STATE ||
		r == BLE_ERROR_INVALID_CONN_HANDLE)
	{
		return;
	}
	UnexpectedErrorSend(ConnHdl, r);
}

// Ask the application whether a peer that already holds a bond record may pair
// again and replace it.
//
// Default deny. The flag is cleared at the start of every security procedure,
// so an application that does not answer refuses, and one that answered
// earlier in the same procedure is not asked twice.
static bool RepairingAllowed(uint16_t ConnHdl)
{
	if (ble_conn_state_user_flag_get(ConnHdl, s_FlagAllowRepairing))
	{
		return true;
	}

	pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_CONFIG_REQ, ConnHdl);
	EvtSend(&evt);

	return ble_conn_state_user_flag_get(ConnHdl, s_FlagAllowRepairing);
}

// ---- Procedure bookkeeping --------------------------------------------------

static void SecProcStart(uint16_t ConnHdl, bool bSuccess, pm_conn_sec_procedure_t Procedure)
{
	ble_conn_state_user_flag_set(ConnHdl, s_FlagSecProc, bSuccess);
	if (bSuccess)
	{
		ble_conn_state_user_flag_set(ConnHdl, s_FlagSecProcPairing,
									 Procedure != PM_CONN_SEC_PROCEDURE_ENCRYPTION);
		ble_conn_state_user_flag_set(ConnHdl, s_FlagSecProcBonding,
									 Procedure == PM_CONN_SEC_PROCEDURE_BONDING);

		pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_START, ConnHdl);
		evt.params.conn_sec_start.procedure = Procedure;
		EvtSend(&evt);
	}
}

// True while a pairing (not encryption-only) procedure runs on the link.
static bool ProcIsPairing(uint16_t ConnHdl)
{
	return ble_conn_state_user_flag_get(ConnHdl, s_FlagSecProc) &&
		   ble_conn_state_user_flag_get(ConnHdl, s_FlagSecProcPairing);
}

static pm_conn_sec_procedure_t ProcGet(uint16_t ConnHdl)
{
	if (!ble_conn_state_user_flag_get(ConnHdl, s_FlagSecProcPairing))
	{
		return PM_CONN_SEC_PROCEDURE_ENCRYPTION;
	}
	return ble_conn_state_user_flag_get(ConnHdl, s_FlagSecProcBonding) ?
		   PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING;
}

// Common failure emission: report CONN_SEC_FAILED with the in-flight procedure
// and clear the procedure flag.
static void SecFailureSend(uint16_t ConnHdl, pm_sec_error_code_t Error, uint8_t ErrorSrc)
{
	if (!ble_conn_state_user_flag_get(ConnHdl, s_FlagSecProc))
	{
		return;		// no procedure in flight; nothing to report
	}
	ble_conn_state_user_flag_set(ConnHdl, s_FlagSecProc, false);

	pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_FAILED, ConnHdl);
	evt.params.conn_sec_failed.procedure = ProcGet(ConnHdl);
	evt.params.conn_sec_failed.error     = Error;
	evt.params.conn_sec_failed.error_src = ErrorSrc;
	EvtSend(&evt);
}

// ---- Keyset construction (the FDS layout anchor) ----------------------------

// Point the SoftDevice keyset into the pm_peer_data_bonding_t inside the
// peer_database write buffer, so the distributed keys land directly in the
// FDS-destined structure. Returns NRF_SUCCESS, NRF_ERROR_BUSY (no buffer yet,
// retried by the pending pump) or an internal error.
static ret_code_t SecKeysetFill(uint16_t ConnHdl, uint8_t Role,
								ble_gap_sec_keyset_t *pKeyset)
{
	pm_peer_data_t peerData;
	ret_code_t r = pdb_write_buf_get(PDB_TEMP_PEER_ID(ConnHdl),
									 PM_PEER_DATA_ID_BONDING, 1, &peerData);
	if (r == NRF_ERROR_BUSY)
	{
		return r;
	}
	if (r != NRF_SUCCESS)
	{
		return NRF_ERROR_INTERNAL;
	}

