IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
	memset(peerData.p_bonding_data, 0, sizeof(pm_peer_data_bonding_t));
	peerData.p_bonding_data->own_role = Role;

	pKeyset->keys_own.p_enc_key  = &peerData.p_bonding_data->own_ltk;
	pKeyset->keys_own.p_pk       = BtLescPubKeyGet();
	pKeyset->keys_peer.p_enc_key = &peerData.p_bonding_data->peer_ltk;
	pKeyset->keys_peer.p_id_key  = &peerData.p_bonding_data->peer_ble_id;

	BtSecSdLink_t *pLink = LinkGet(ConnHdl);
	if (pLink == nullptr)
	{
		(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(ConnHdl),
									 PM_PEER_DATA_ID_BONDING);
		return NRF_ERROR_INVALID_STATE;
	}
	pKeyset->keys_peer.p_pk      = &pLink->PeerPk;

	// The address the peer used at connection establishment; overwritten by
	// the identity if the peer distributes one.
	r = im_ble_addr_get(ConnHdl, &peerData.p_bonding_data->peer_ble_id.id_addr_info);
	if (r != NRF_SUCCESS)
	{
		(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(ConnHdl),
									 PM_PEER_DATA_ID_BONDING);
		return NRF_ERROR_INVALID_STATE;
	}

	return NRF_SUCCESS;
}

// ---- sec params reply (SEC_PARAMS_REQUEST answer) ---------------------------

static ret_code_t ParamsReplyPerform(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	uint8_t              role = ble_conn_state_role(ConnHdl);
	uint8_t              secStatus = BLE_GAP_SEC_STATUS_SUCCESS;
	ble_gap_sec_params_t *pReplyParams = pSecParams;
	ble_gap_sec_keyset_t keyset;
	ret_code_t           r = NRF_SUCCESS;
	bool                 bKeysetPrepared = false;

	memset(&keyset, 0, sizeof(keyset));

	if (role == BLE_GAP_ROLE_INVALID)
	{
		return BLE_ERROR_INVALID_CONN_HANDLE;
	}

#if PM_RA_PROTECTION_ENABLED
	if (ast_peer_blacklisted(ConnHdl))
	{
		secStatus    = BLE_GAP_SEC_STATUS_REPEATED_ATTEMPTS;
		pReplyParams = NULL;
	}
	else
#endif
	if (pSecParams == NULL)
	{
		// Reject pairing.
		secStatus    = BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP;
		pReplyParams = NULL;
	}
	else
	{
		r = SecKeysetFill(ConnHdl, role, &keyset);
		if (r != NRF_SUCCESS)
		{
			ble_conn_state_user_flag_set(ConnHdl, s_FlagReplyPendBusy,
										 r == NRF_ERROR_BUSY);
			return r;
		}
		bKeysetPrepared = true;
	}

	if (role == BLE_GAP_ROLE_CENTRAL)
	{
		// Central: parameters were given at sd_ble_gap_authenticate.
		pReplyParams = NULL;
	}

	r = sd_ble_gap_sec_params_reply(ConnHdl, secStatus, pReplyParams,
									(secStatus == BLE_GAP_SEC_STATUS_SUCCESS) ?
									&keyset : NULL);
	ble_conn_state_user_flag_set(ConnHdl, s_FlagReplyPendBusy, r == NRF_ERROR_BUSY);

	if (bKeysetPrepared && r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
	{
		(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(ConnHdl),
									 PM_PEER_DATA_ID_BONDING);
	}

	if (r == NRF_ERROR_INVALID_STATE && !ble_conn_state_valid(ConnHdl))
	{
		return NRF_SUCCESS;		// link dropped; benign
	}
	// A live link returning INVALID_STATE is a sequencing defect (duplicate
	// reply, wrong phase) and surfaces to the caller.
	// NRF_ERROR_BUSY propagates: ReplyAttempt must see it to keep the exact
	// reply for the retry. Conversion to a success result for the public API
	// happens at the callers.
	return r;
}

// Perform a reply and keep the exact answer, including a rejection, for the
// BUSY retry. On a terminal result the pending record is cleared.
static ret_code_t ReplyAttempt(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	ret_code_t r = ParamsReplyPerform(ConnHdl, pSecParams);
	BtSecSdLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr)
	{
		if (r == NRF_ERROR_BUSY)
		{
			pLink->bReplyReject = (pSecParams == NULL);
			if (pSecParams != NULL)
			{
				pLink->ReplyParams = *pSecParams;
			}
			pLink->bReplyValid = true;
		}
		else
		{
			pLink->bReplyValid  = false;
			pLink->bReplyReject = false;
		}
	}
	return r;
}

// PM_EVT_CONN_SEC_PARAMS_REQ handling: emit the event with a reply context; if
// the application does not answer within its handler through
// sm_sec_params_reply, reply with the context (default) parameters.
static void ParamsRequestProcess(uint16_t ConnHdl, const ble_gap_sec_params_t *pPeerParams)
{
	SecParamsReplyCtx_t ctx;

	ctx.pSecParams   = s_pSecParams;
	ctx.bReplyCalled = false;

	pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_PARAMS_REQ, ConnHdl);
	evt.params.conn_sec_params_req.p_peer_params = pPeerParams;
	evt.params.conn_sec_params_req.p_context     = &ctx;
	EvtSend(&evt);

	if (!ctx.bReplyCalled)
	{
		ret_code_t r = ReplyAttempt(ConnHdl, ctx.pSecParams);
		if (r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
		{
			UnexpectedErrorSend(ConnHdl, r);
		}
	}
}

// ---- link secure (pm_conn_secure and Security Request) ----------------------

static ret_code_t LinkSecureCentralEncrypt(uint16_t ConnHdl, pm_peer_id_t PeerId)
{
	pm_peer_data_flash_t peerData;
	const ble_gap_enc_key_t *pKey = NULL;
	bool lesc = false;

	ret_code_t r = pdb_peer_data_ptr_get(PeerId, PM_PEER_DATA_ID_BONDING, &peerData);
	if (r == NRF_SUCCESS)
	{
		// Peer distributed its LTK as peripheral; for LESC both sides hold
		// the same LTK under own_ltk. Which one was used is a property of the
		// bond, so it is read from own_ltk before either key is chosen.
		pKey = &peerData.p_bonding_data->peer_ltk;
		lesc = peerData.p_bonding_data->own_ltk.enc_info.lesc;
		if (lesc)
		{
			pKey = &peerData.p_bonding_data->own_ltk;
		}
	}
	else if (r != NRF_ERROR_NOT_FOUND)
	{
		return (r == NRF_ERROR_BUSY) ? NRF_ERROR_BUSY : NRF_ERROR_INTERNAL;
	}

	// A legacy bond is re-encrypted by quoting the EDIV and Rand the peripheral
	// issued, so a record without them is unusable however long its key is:
	// sd_ble_gap_encrypt would go out with an all zero master id and the
	// peripheral would answer Pin or Key Missing. A LESC LTK has an all zero
	// master id by design, so that test is skipped there. Core Vol 3 Part H
	// 2.4.4, and the same rule the SDK peer manager applies in
	// link_secure_central_encryption.
	if (pKey == NULL || !pKey->enc_info.ltk_len ||
		(!lesc && !im_master_id_is_valid(&pKey->master_id)))
	{
		return NRF_ERROR_NOT_FOUND;		// no usable key; caller falls back to pairing
	}

	r = sd_ble_gap_encrypt(ConnHdl, &pKey->master_id, &pKey->enc_info);
	if (r == NRF_SUCCESS)
	{
		SecProcStart(ConnHdl, true, PM_CONN_SEC_PROCEDURE_ENCRYPTION);
	}
	return r;
}

static ret_code_t LinkSecureAuthenticate(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	ret_code_t r = sd_ble_gap_authenticate(ConnHdl, pSecParams);

