IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
	if (r == NRF_SUCCESS)
	{
		uint8_t role = ble_conn_state_role(ConnHdl);
		if (role == BLE_GAP_ROLE_CENTRAL && pSecParams != NULL)
		{
			SecProcStart(ConnHdl, true, pSecParams->bond ?
						 PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING);
		}
		// Peripheral: this sends the Security Request; the procedure starts
		// at SEC_PARAMS_REQUEST when the central responds.
	}
	else if (r == NRF_ERROR_NO_MEM)
	{
		r = NRF_ERROR_BUSY;		// too many concurrent procedures; retried
	}
	return r;
}

static ret_code_t LinkSecure(uint16_t ConnHdl, bool bNullParams, bool bForceRepairing,
							 bool bSendEvents)
{
	ret_code_t            r;
	ble_gap_sec_params_t *pParams = bNullParams ? NULL : s_pSecParams;
	uint8_t               role = ble_conn_state_role(ConnHdl);

	if (role == BLE_GAP_ROLE_INVALID)
	{
		return BLE_ERROR_INVALID_CONN_HANDLE;
	}

	if (role == BLE_GAP_ROLE_CENTRAL && !bForceRepairing)
	{
		pm_peer_id_t peerId = im_peer_id_get_by_conn_handle(ConnHdl);

		if (peerId != PM_PEER_ID_INVALID)
		{
			r = LinkSecureCentralEncrypt(ConnHdl, peerId);
			if (r != NRF_ERROR_NOT_FOUND)
			{
				goto done;
			}
			// No stored key: fall through to pairing.
		}
	}

	r = LinkSecureAuthenticate(ConnHdl, pParams);

done:
	// Track retry state for BUSY; remember the call shape for the retry.
	ble_conn_state_user_flag_set(ConnHdl, s_FlagSecurePendBusy, r == NRF_ERROR_BUSY);
	if (r == NRF_ERROR_BUSY)
	{
		ble_conn_state_user_flag_set(ConnHdl, s_FlagSecureForceRepair, bForceRepairing);
		ble_conn_state_user_flag_set(ConnHdl, s_FlagSecureNullParams, bNullParams);
	}

	if (bSendEvents && r != NRF_SUCCESS && r != NRF_ERROR_BUSY &&
		r != NRF_ERROR_INVALID_STATE)
	{
		if (r == NRF_ERROR_TIMEOUT)
		{
			pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_FAILED, ConnHdl);
			evt.params.conn_sec_failed.procedure =
				(pParams != NULL && pParams->bond) ? PM_CONN_SEC_PROCEDURE_BONDING
												   : PM_CONN_SEC_PROCEDURE_PAIRING;
			evt.params.conn_sec_failed.error     = PM_CONN_SEC_ERROR_SMP_TIMEOUT;
			evt.params.conn_sec_failed.error_src = BLE_GAP_SEC_STATUS_SOURCE_LOCAL;
			EvtSend(&evt);
		}
		else
		{
			UnexpectedErrorSend(ConnHdl, r);
		}
	}

	if (r == NRF_ERROR_BUSY ||
		(r == NRF_ERROR_INVALID_STATE && !ble_conn_state_valid(ConnHdl)))
	{
		r = NRF_SUCCESS;	// BUSY retried by the pump; INVALID_STATE: link gone
	}
	return r;
}

// ---- GAP event handlers -----------------------------------------------------

static void SecParamsRequestProcess(const ble_gap_evt_t *pGapEvt)
{
	if (s_bScOnly && !pGapEvt->params.sec_params_request.peer_params.lesc)
	{
		// Secure Connections Only: reject legacy pairing without asking the
		// application. The failure is reported through AUTH_STATUS.
		(void)sd_ble_gap_sec_params_reply(pGapEvt->conn_handle,
										  BLE_GAP_SEC_STATUS_AUTH_REQ, NULL, NULL);
		return;
	}

	if (ble_conn_state_role(pGapEvt->conn_handle) == BLE_GAP_ROLE_PERIPH)
	{
		// New security procedure: reset the repairing decision for the link.
		ble_conn_state_user_flag_set(pGapEvt->conn_handle, s_FlagAllowRepairing, false);
		SecProcStart(pGapEvt->conn_handle, true,
					 pGapEvt->params.sec_params_request.peer_params.bond ?
					 PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING);

		// The peer already has a bond record and the application will not have
		// it replaced. Core Vol 3 Part H 2.3: "If the responding device does
		// not support pairing or pairing cannot be performed then the
		// responding device shall respond using the Pairing Failed message
		// with the error code Pairing Not Supported", which is what a NULL
		// parameters reply produces. Answering here, at the Pairing Request,
		// is the point of it: the keys are never exchanged and the old bond is
		// never at risk. A peer whose identity only becomes known during key
		// distribution is caught again at AUTH_STATUS.
		if (im_peer_id_get_by_conn_handle(pGapEvt->conn_handle) != PM_PEER_ID_INVALID &&
			!RepairingAllowed(pGapEvt->conn_handle))
		{
			ret_code_t r = ReplyAttempt(pGapEvt->conn_handle, NULL);
			if (r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
			{
				UnexpectedErrorSend(pGapEvt->conn_handle, r);
			}
			return;
		}
	}
	ParamsRequestProcess(pGapEvt->conn_handle,
						 &pGapEvt->params.sec_params_request.peer_params);
}

static void SecInfoRequestProcess(const ble_gap_evt_t *pGapEvt)
{
	const ble_gap_enc_info_t *pEncInfo = NULL;
	pm_peer_data_flash_t      peerData;

	pm_peer_id_t peerId = im_peer_id_get_by_master_id(
							(ble_gap_master_id_t *)&pGapEvt->params.sec_info_request.master_id);
	if (peerId == PM_PEER_ID_INVALID)
	{
		peerId = im_peer_id_get_by_conn_handle(pGapEvt->conn_handle);
	}
	else
	{
		// The peer may have been unrecognized until now (e.g. random
		// non-resolvable advertising address). Record the discovery.
		im_new_peer_id(pGapEvt->conn_handle, peerId);
	}

	SecProcStart(pGapEvt->conn_handle, true, PM_CONN_SEC_PROCEDURE_ENCRYPTION);

	if (peerId != PM_PEER_ID_INVALID)
	{
		ret_code_t r = pdb_peer_data_ptr_get(peerId, PM_PEER_DATA_ID_BONDING, &peerData);
		if (r == NRF_SUCCESS)
		{
			// Reply with own LTK when it is the one the request names. A LESC
			// LTK has an all-zero master id (nothing to compare, and the
			// compare treats a zero id as invalid), so the lesc flag alone
			// selects it, exactly as the SDK dispatcher does.
			const ble_gap_enc_key_t *pKey = &peerData.p_bonding_data->own_ltk;

			if (pGapEvt->params.sec_info_request.enc_info &&
				(pKey->enc_info.lesc ||
				 im_master_ids_compare(&pKey->master_id,
									   &pGapEvt->params.sec_info_request.master_id)))
			{
				pEncInfo = &pKey->enc_info;
			}
		}
		else if (r != NRF_ERROR_NOT_FOUND)
		{
			UnexpectedErrorSend(pGapEvt->conn_handle, r);
		}
	}

	ret_code_t r = sd_ble_gap_sec_info_reply(pGapEvt->conn_handle, pEncInfo, NULL, NULL);
	if (r == NRF_ERROR_INVALID_STATE)
	{
		// Another module already replied; nothing to do.
	}
	else if (r != NRF_SUCCESS)
	{
		UnexpectedErrorSend(pGapEvt->conn_handle, r);
	}
	else if (pGapEvt->params.sec_info_request.enc_info && pEncInfo == NULL)
	{
		SecFailureSend(pGapEvt->conn_handle, PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING,
					   BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
	}
}

// Central receives a Security Request from the peripheral.
static void SecRequestProcess(const ble_gap_evt_t *pGapEvt)
{
	bool bForceRepairing = false;
	bool bNullParams = (s_pSecParams == NULL);

	if (!bNullParams && ble_conn_state_encrypted(pGapEvt->conn_handle))
	{
		pm_conn_sec_status_t req;

		memset(&req, 0, sizeof(req));
		req.bonded         = pGapEvt->params.sec_request.bond;
		req.mitm_protected = pGapEvt->params.sec_request.mitm;
		req.lesc           = pGapEvt->params.sec_request.lesc;
		bForceRepairing    = !sm_sec_is_sufficient(pGapEvt->conn_handle, &req);
	}

	(void)LinkSecure(pGapEvt->conn_handle, bNullParams, bForceRepairing, true);

	// Forward the request to the application, as the SDK does.
	pm_evt_t evt = NewEvt(PM_EVT_SLAVE_SECURITY_REQ, pGapEvt->conn_handle);
	evt.params.slave_security_req.bond = pGapEvt->params.sec_request.bond;
	evt.params.slave_security_req.mitm = pGapEvt->params.sec_request.mitm;
	EvtSend(&evt);
}

static void PairingSuccessSend(const ble_gap_evt_t *pGapEvt, bool bDataStored)
{
	ble_conn_state_user_flag_set(pGapEvt->conn_handle, s_FlagSecProc, false);

