IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
	pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_SUCCEEDED, pGapEvt->conn_handle);
	evt.params.conn_sec_succeeded.procedure = pGapEvt->params.auth_status.bonded ?
			PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING;
	evt.params.conn_sec_succeeded.data_stored = bDataStored;
	EvtSend(&evt);
}

// Commit the bond. NRF_ERROR_BUSY (peer data queue full) defers the store and
// the retry pumps repeat it; the terminal pairing event is emitted only when
// the store reaches a terminal result, so data_stored is accurate.
// NRF_ERROR_STORAGE_FULL is not a failure: peer_database keeps the buffer and
// reattempts after garbage collection, so the bond is reported stored and a
// STORAGE_FULL event tells the application to make room.
static void BondStoreAttempt(uint16_t ConnHdl, pm_peer_id_t PeerId, bool bNewPeer)
{
	BtSecSdLink_t *pLink = LinkGet(ConnHdl);
	ret_code_t r = pdb_write_buf_store(PDB_TEMP_PEER_ID(ConnHdl),
									   PM_PEER_DATA_ID_BONDING, PeerId);

	if (r == NRF_ERROR_BUSY && pLink != nullptr)
	{
		pLink->bStorePending = true;
		pLink->bStoreNewPeer = bNewPeer;
		pLink->StorePeerId   = PeerId;
		return;			// retried by the pumps; no terminal event yet
	}

	if (pLink != nullptr)
	{
		pLink->bStorePending = false;
	}

	// Flash is full. peer_database keeps the write buffer (store_flash_full)
	// and reattempts after the next garbage collection, so the bond is not
	// lost: report it stored, emit the recoverable STORAGE_FULL event, and do
	// not free the peer id. Matches the SDK security_dispatcher behavior.
	if (r == NRF_ERROR_STORAGE_FULL)
	{
		StorageFullSend(ConnHdl);
		r = NRF_SUCCESS;
	}

	ble_conn_state_user_flag_set(ConnHdl, s_FlagSecProc, false);

	pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_SUCCEEDED, ConnHdl);
	evt.params.conn_sec_succeeded.procedure   = PM_CONN_SEC_PROCEDURE_BONDING;
	evt.params.conn_sec_succeeded.data_stored = (r == NRF_SUCCESS);
	if (r != NRF_SUCCESS)
	{
		UnexpectedErrorSend(ConnHdl, r);
		if (bNewPeer)
		{
			(void)im_peer_free(PeerId);
		}
	}
	EvtSend(&evt);
}

static void AuthStatusSuccessProcess(const ble_gap_evt_t *pGapEvt)
{
	uint16_t connHdl = pGapEvt->conn_handle;
	BtSecSdLink_t *pKsLink = LinkGet(connHdl);

	if (pKsLink != nullptr && pKsLink->EncrKeySize != 0 &&
		pKsLink->EncrKeySize < s_MinKeySize)
	{
		// The key size check already failed the procedure and requested the
		// disconnect; do not store a bond keyed below policy.
		(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(connHdl), PM_PEER_DATA_ID_BONDING);
		return;
	}

	if (!pGapEvt->params.auth_status.bonded)
	{
		// Pairing without bonding: nothing to store. Release the buffer that
		// was prepared at the params reply.
		(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(connHdl), PM_PEER_DATA_ID_BONDING);
		PairingSuccessSend(pGapEvt, false);
		return;
	}

	// Locate or allocate the peer id for the new bond.
	bool         bNewPeerId = false;
	pm_peer_data_t peerData;
	pm_peer_id_t peerId = im_peer_id_get_by_conn_handle(connHdl);

	ret_code_t r = pdb_write_buf_get(PDB_TEMP_PEER_ID(connHdl),
									 PM_PEER_DATA_ID_BONDING, 1, &peerData);
	if (r != NRF_SUCCESS)
	{
		UnexpectedErrorSend(connHdl, r);
		PairingSuccessSend(pGapEvt, false);
		return;
	}

	if (peerId == PM_PEER_ID_INVALID)
	{
		// Repairing detection: an existing bond for this identity.
		peerId = im_find_duplicate_bonding_data(peerData.p_bonding_data, PM_PEER_ID_INVALID);
		if (peerId != PM_PEER_ID_INVALID)
		{
			// Known identity re-pairing, discovered only now. A peer that was
			// already identified at the Pairing Request was answered there,
			// before any key was exchanged; this is the remainder, a peer that
			// connected under an address this device could not resolve and
			// turned out to hold a bond once it distributed its identity.
			//
			// Map the connection to the existing peer first (the SDK does), so
			// peer lookups work even when the application denies. Then ask,
			// unless the answer was already given for this procedure. On deny
			// the old record is kept and the link is dropped: the SMP exchange
			// completed inside the SoftDevice before the identity could be
			// known, so there is nothing left to refuse on air.
			im_new_peer_id(connHdl, peerId);

			if (!RepairingAllowed(connHdl))
			{
				// Denied: drop the new bond data, keep the old record, and
				// disconnect. The link is encrypted with a key the application
				// refused, so leaving it up and reporting success (the SDK
				// behavior) is wrong. The procedure flag stays set; the
				// disconnect path reports CONN_SEC_FAILED.
				(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(connHdl),
											PM_PEER_DATA_ID_BONDING);
				SecDisconnect(connHdl);
				return;
			}
		}
	}

	if (peerId == PM_PEER_ID_INVALID)
	{
		peerId = pds_peer_id_allocate();
		if (peerId == PM_PEER_ID_INVALID)
		{
			(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(connHdl),
										 PM_PEER_DATA_ID_BONDING);
			UnexpectedErrorSend(connHdl, NRF_ERROR_NO_MEM);
			PairingSuccessSend(pGapEvt, false);
			return;
		}
		bNewPeerId = true;
		im_new_peer_id(connHdl, peerId);
	}

	BondStoreAttempt(connHdl, peerId, bNewPeerId);
}

static void AuthStatusProcess(const ble_gap_evt_t *pGapEvt)
{
	LinkReplyClear(pGapEvt->conn_handle);

	if (pGapEvt->params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS)
	{
		AuthStatusSuccessProcess(pGapEvt);
	}
	else
	{
		(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(pGapEvt->conn_handle),
									PM_PEER_DATA_ID_BONDING);
		SecFailureSend(pGapEvt->conn_handle,
					   pGapEvt->params.auth_status.auth_status,
					   pGapEvt->params.auth_status.error_src);
#if PM_RA_PROTECTION_ENABLED
		ast_auth_error_notify(pGapEvt->conn_handle);
#endif
	}
}

static void ConnSecUpdateProcess(const ble_gap_evt_t *pGapEvt)
{
	uint8_t keySize = pGapEvt->params.conn_sec_update.conn_sec.encr_key_size;
	BtSecSdLink_t *pLink = LinkGet(pGapEvt->conn_handle);

	if (pLink != nullptr)
	{
		pLink->EncrKeySize = keySize;
	}

	if (ble_conn_state_encrypted(pGapEvt->conn_handle) && keySize < s_MinKeySize)
	{
		// Under-keyed link: fail the procedure and disconnect regardless of
		// whether this is a fresh pairing or a reconnect.
		SecFailureSend(pGapEvt->conn_handle, BLE_GAP_SEC_STATUS_ENC_KEY_SIZE,
					   BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
		SecDisconnect(pGapEvt->conn_handle);
		return;
	}

