IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
	if (ProcIsPairing(pGapEvt->conn_handle))
	{
		return;		// pairing completion is reported at AUTH_STATUS
	}

	if (!ble_conn_state_encrypted(pGapEvt->conn_handle))
	{
		SecFailureSend(pGapEvt->conn_handle, PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING,
					   BLE_GAP_SEC_STATUS_SOURCE_REMOTE);
		return;
	}

	ble_conn_state_user_flag_set(pGapEvt->conn_handle, s_FlagSecProc, false);

	pm_evt_t evt = NewEvt(PM_EVT_CONN_SEC_SUCCEEDED, pGapEvt->conn_handle);
	evt.params.conn_sec_succeeded.procedure   = PM_CONN_SEC_PROCEDURE_ENCRYPTION;
	evt.params.conn_sec_succeeded.data_stored = false;
	EvtSend(&evt);
}

static void DisconnectProcess(const ble_gap_evt_t *pGapEvt)
{
	pm_sec_error_code_t error =
		(pGapEvt->params.disconnected.reason == BLE_HCI_CONN_TERMINATED_DUE_TO_MIC_FAILURE) ?
		PM_CONN_SEC_ERROR_MIC_FAILURE : PM_CONN_SEC_ERROR_DISCONNECT;

	SecFailureSend(pGapEvt->conn_handle, error, BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
	LinkReplyClear(pGapEvt->conn_handle);

	BtSecSdLink_t *pLink = LinkGet(pGapEvt->conn_handle);
	if (pLink != nullptr && pLink->bStorePending)
	{
		pLink->bStorePending = false;
		if (pLink->bStoreNewPeer)
		{
			(void)im_peer_free(pLink->StorePeerId);
		}
	}
	(void)pdb_write_buf_release(PDB_TEMP_PEER_ID(pGapEvt->conn_handle),
								PM_PEER_DATA_ID_BONDING);
}

// ---- Retry pumps ------------------------------------------------------------

static void ReplyPendingHandle(uint16_t ConnHdl, void *pCtx)
{
	(void)pCtx;
	ble_gap_sec_params_t *pParams = s_pSecParams;
	BtSecSdLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr && pLink->bReplyValid)
	{
		// Replay the application reply exactly, including a rejection.
		pParams = pLink->bReplyReject ? NULL : &pLink->ReplyParams;
	}
	(void)ReplyAttempt(ConnHdl, pParams);
}

static void SecurePendingHandle(uint16_t ConnHdl, void *pCtx)
{
	(void)pCtx;
	bool bForce = ble_conn_state_user_flag_get(ConnHdl, s_FlagSecureForceRepair);
	bool bNull  = ble_conn_state_user_flag_get(ConnHdl, s_FlagSecureNullParams);

	(void)LinkSecure(ConnHdl, bNull, bForce, true);
}

static void PendingPumpsRun(void)
{
	(void)ble_conn_state_for_each_set_user_flag(s_FlagReplyPendBusy,
											ReplyPendingHandle, NULL);
	(void)ble_conn_state_for_each_set_user_flag(s_FlagSecurePendBusy,
											SecurePendingHandle, NULL);

	for (uint16_t h = 0; h < NRF_SDH_BLE_TOTAL_LINK_COUNT; h++)
	{
		if (s_Links[h].bStorePending && ble_conn_state_valid(h))
		{
			s_Links[h].bStorePending = false;
			BondStoreAttempt(h, s_Links[h].StorePeerId, s_Links[h].bStoreNewPeer);
		}

		if (s_Links[h].bDisconnPending && ble_conn_state_valid(h))
		{
			// SecDisconnect sets the flag again if the link is still held.
			s_Links[h].bDisconnPending = false;
			SecDisconnect(h);
		}
	}
}

// ---- sm_* API surface (called by peer_manager.c) ----------------------------
// Declared in security_manager.h / security_dispatcher.h, which impose C
// linkage on every declaration; the definitions inherit it. The one function
// the SDK reaches through a local extern in peer_database.c instead of a
// header, sm_pdb_evt_handler, is marked on its definition.

// pm_init calls smd_init right after sm_init. Everything the dispatcher
// initialized lives in this module and is set up in sm_init, so this only
// checks the ordering held.
ret_code_t smd_init(void)
{
	return s_bInit ? NRF_SUCCESS : NRF_ERROR_INVALID_STATE;
}

ret_code_t sm_init(void)
{
	if (s_bInit)
	{
		return NRF_ERROR_INVALID_STATE;
	}

	if (!BtLescInit())
	{
		return NRF_ERROR_INTERNAL;
	}

	s_FlagSecProc           = ble_conn_state_user_flag_acquire();
	s_FlagSecProcPairing    = ble_conn_state_user_flag_acquire();
	s_FlagSecProcBonding    = ble_conn_state_user_flag_acquire();
	s_FlagAllowRepairing    = ble_conn_state_user_flag_acquire();
	s_FlagSecurePendBusy    = ble_conn_state_user_flag_acquire();
	s_FlagSecureForceRepair = ble_conn_state_user_flag_acquire();
	s_FlagSecureNullParams  = ble_conn_state_user_flag_acquire();
	s_FlagReplyPendBusy     = ble_conn_state_user_flag_acquire();

	if (s_FlagReplyPendBusy == BLE_CONN_STATE_USER_FLAG_INVALID)
	{
		return NRF_ERROR_INTERNAL;	// raise BLE_CONN_STATE_USER_FLAG_COUNT
	}

#if PM_RA_PROTECTION_ENABLED
	ret_code_t r = ast_init();
	if (r != NRF_SUCCESS)
	{
		return r;
	}
#endif

	s_bInit = true;
	return NRF_SUCCESS;
}

void sm_ble_evt_handler(ble_evt_t const * p_ble_evt)
{
	const ble_gap_evt_t *pGapEvt = &p_ble_evt->evt.gap_evt;

	switch (p_ble_evt->header.evt_id)
	{
	case BLE_GAP_EVT_CONNECTED:
	{
		// Connection handles are recycled by the SoftDevice. Reset the whole
		// per-link record so no state from a previous connection on this
		// handle (pending reply, deferred store, key size, peer key) can leak
		// into the new one. The structural reset here is the invariant; the
		// per-event clears elsewhere are then belt and braces.
		BtSecSdLink_t *pLink = LinkGet(pGapEvt->conn_handle);
		if (pLink != nullptr)
		{
			memset(pLink, 0, sizeof(*pLink));
		}
		break;
	}

	case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		SecParamsRequestProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_SEC_INFO_REQUEST:
		SecInfoRequestProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_SEC_REQUEST:
		SecRequestProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_AUTH_STATUS:
		AuthStatusProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_CONN_SEC_UPDATE:
		ConnSecUpdateProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_DISCONNECTED:
		DisconnectProcess(pGapEvt);
		break;

	default:
		break;
	}

	// LESC key handling: single delivery point into the bt_lesc module.
	BtLescOnBleEvt(p_ble_evt);

	PendingPumpsRun();
}

extern "C" void sm_pdb_evt_handler(pm_evt_t * p_event)
{
	switch (p_event->evt_id)
	{
	case PM_EVT_FLASH_GARBAGE_COLLECTED:
	case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
	case PM_EVT_PEER_DATA_UPDATE_FAILED:
	case PM_EVT_PEER_DELETE_SUCCEEDED:
	case PM_EVT_PEER_DELETE_FAILED:
		// Storage capacity may have changed; retry pending work.
		PendingPumpsRun();
		break;

	default:
		break;
	}
}

// IOsonata extensions beyond the SDK sm ABI.
void BtSecSdScOnlySet(bool bEnable)
{
	s_bScOnly = bEnable;
}

void BtSecSdMinKeySizeSet(uint8_t Size)
{
	if (Size >= 7 && Size <= 16)
	{
		s_MinKeySize = Size;
	}
}

ret_code_t sm_sec_params_set(ble_gap_sec_params_t * p_sec_params)
{
	if (p_sec_params == NULL)
	{
		s_pSecParams = NULL;
	}
	else
	{
		s_SecParams  = *p_sec_params;
		s_pSecParams = &s_SecParams;
	}
	return NRF_SUCCESS;
}

ret_code_t sm_sec_params_reply(uint16_t conn_handle, ble_gap_sec_params_t * p_sec_params,
							   void const * p_context)
{
	if (p_context == NULL)
	{
		return NRF_ERROR_NULL;
	}

	SecParamsReplyCtx_t *pCtx = (SecParamsReplyCtx_t *)p_context;

	if (p_sec_params == NULL)
	{
		pCtx->pSecParams = NULL;			// reject pairing
	}
	else
	{
		pCtx->SecParamsMem = *p_sec_params;
		pCtx->pSecParams   = &pCtx->SecParamsMem;
	}
	pCtx->bReplyCalled = true;

