IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_sec_sd.cpp
	ret_code_t r = ReplyAttempt(conn_handle, pCtx->pSecParams);
	if (r == NRF_ERROR_BUSY)
	{
		r = NRF_SUCCESS;	// retried by the pending pump
	}
	return r;
}

void sm_conn_sec_config_reply(uint16_t conn_handle, pm_conn_sec_config_t * p_conn_sec_config)
{
	if (p_conn_sec_config != NULL)
	{
		ble_conn_state_user_flag_set(conn_handle, s_FlagAllowRepairing,
									 p_conn_sec_config->allow_repairing);
	}
}

ret_code_t sm_lesc_public_key_set(ble_gap_lesc_p256_pk_t * p_public_key)
{
	// The LESC key pair is owned by the bt_lesc module; an externally
	// supplied key is not supported.
	(void)p_public_key;
	return NRF_ERROR_FORBIDDEN;
}

ret_code_t sm_conn_sec_status_get(uint16_t conn_handle, pm_conn_sec_status_t * p_conn_sec_status)
{
	if (p_conn_sec_status == NULL)
	{
		return NRF_ERROR_NULL;
	}

	uint8_t role = ble_conn_state_role(conn_handle);
	if (role == BLE_GAP_ROLE_INVALID)
	{
		return BLE_ERROR_INVALID_CONN_HANDLE;
	}

	pm_peer_id_t peerId = im_peer_id_get_by_conn_handle(conn_handle);

	memset(p_conn_sec_status, 0, sizeof(*p_conn_sec_status));
	p_conn_sec_status->connected      = true;
	p_conn_sec_status->encrypted      = ble_conn_state_encrypted(conn_handle);
	p_conn_sec_status->mitm_protected = ble_conn_state_mitm_protected(conn_handle);
	p_conn_sec_status->bonded         = (peerId != PM_PEER_ID_INVALID);
	p_conn_sec_status->lesc           = ble_conn_state_lesc(conn_handle);

	if (!p_conn_sec_status->lesc && peerId != PM_PEER_ID_INVALID &&
		p_conn_sec_status->encrypted)
	{
		// Encrypted from a stored LESC bond: the link flag only reflects a
		// live pairing, so consult the bond record.
		pm_peer_data_flash_t peerData;
		if (pdb_peer_data_ptr_get(peerId, PM_PEER_DATA_ID_BONDING, &peerData) == NRF_SUCCESS)
		{
			p_conn_sec_status->lesc = peerData.p_bonding_data->own_ltk.enc_info.lesc;
		}
	}

	return NRF_SUCCESS;
}

bool sm_sec_is_sufficient(uint16_t conn_handle, pm_conn_sec_status_t * p_sec_status_req)
{
	pm_conn_sec_status_t status;

	if (sm_conn_sec_status_get(conn_handle, &status) != NRF_SUCCESS)
	{
		return false;
	}

	return (!p_sec_status_req->connected      || status.connected) &&
		   (!p_sec_status_req->encrypted      || status.encrypted) &&
		   (!p_sec_status_req->mitm_protected || status.mitm_protected) &&
		   (!p_sec_status_req->bonded         || status.bonded) &&
		   (!p_sec_status_req->lesc           || status.lesc);
}

ret_code_t sm_link_secure(uint16_t conn_handle, bool force_repairing)
{
	if (!s_bInit)
	{
		return NRF_ERROR_INVALID_STATE;
	}
	return LinkSecure(conn_handle, s_pSecParams == NULL, force_repairing, false);
}


#endif // NRF_MODULE_ENABLED(PEER_MANAGER)
